$(document).ready(function(){
	// Countries
	var oblast_arr = new Array("Избери Област",
	"Благоевград","Бургас","Варна","Велико Търново","Видин","Враца",
	"Габрово", "Добрич", "Кърджали", "Кюстендил", "Ловеч", "Монтана", "Пазарджик", "Перник", "Плевен",
	"Пловдив", "Разград", "Русе", "Силистра", "Сливен", "Смолян", "Софийска Област", "София", "Стара Загора",
	"Търговище", "Хасково", "Шумен", "Ямбол");

	$.each(oblast_arr, function (i, item) {
		$('#oblast').append($('<option>', {
			value: i,
			text : item,
		}, '</option>' ));
	});

	// Общини
	var s_a = new Array();
	s_a[0]="Избери община";
	s_a[1]="Избери община|Банско|Белица|Благоевград|Гоце Делчев|Добринище|Кресна|Мелник|Петрич|Разлог|Сандански|Сатовча|Струмяни|Симитли|Хаджидимово|Якоруда";
	s_a[2]="Избери община|Айтос|Бургас|Камено|Карнобат|Малко Търново|Несебър|Поморие|Приморско|Руен|Созопол|Средец|Сунгурларе|Царево";
	s_a[3]="Избери община|Аврен|Аксаково|Белослав|Бяла|Варна|Ветрино|Вълчи дол|Девня|Долни чифлик|Дългопол|Провадия|Суворово";
	s_a[4]="Избери община|Велико Търново|Горна Оряховица|Елена|Златарица|Лясковец|Павликени|Послки Тръмбеш|Свищов|Стражица|Сухиндол";
	s_a[5]="Избери община|Белоградчик|Бойница|Брегово|Видин|Грамада|Димово|Кула|Макреш|Ново село|Ружинци|Чупрене";
	s_a[6]="Избери община|Борован|Бяла Слатина|Враца|Козлодуй|Криводол|Мездра|Мизия|Оряхово|Роман|Хайредин";
	s_a[7]="Избери община|Габрово|Дряново|Севлиево|Трявна";
	s_a[8]="Избери община|Балчик|Генерал Тошево|Добрич|Добрич-селска|Каварна|Крушари|Тервел|Шабла";
	s_a[9]="Избери община|Ардино|Джебел|Кирково|Крумовград|Кърджали|Момчилград|Черноочене";
	s_a[10]="Избери община|Бобов дол|Община Бобошево|Кочериново|Кюстендил|Невестино|Рила|Сапарева баня|Дупница|Трекляно";
	s_a[11]="Избери община|Априлци|Летница|Ловеч|Луковит|Тетевен|Троян|Угърчин|Ябланица";
	s_a[12]="Избери община|Берковица|Бойчиновци|Брусарци|Вълчедръм|Вършец|Георги Дамяново|Лом|Медковец|Монтана|Чипровци|Якимово";
	s_a[13]="Избери община|Батак|Белово|Брацигово|Велинград|Лесичово|Пазарджик|Панагюрище|Пещера|Ракитово|Септември|Стрелча|Сърница";
	s_a[14]="Избери община|Брезник|Земен|Ковачевци|Перник|Радомир|Трън";
	s_a[15]="Избери община|Белене|Гулянци|Долна Митрополия|Долни Дъбник|Искър|Кнежа|Левски|Никопол|Плевен|Пордим|Червен бряг";
	s_a[16]="Избери община|Асеновград|Брезово|Калояново|Карлово|Кричим|Куклен|Лъки|Марица|Перущица|Пловдив|Първомай|Раковски|Родопи|Садово|Сопот|Стамболийски|Съединение|Хисаря";
	s_a[17]="Избери община|Завет|Исперих|Кубрат|Лозница|Разград|Самуил|Цар Калоян";
	s_a[18]="Избери община|Борово|Бяла|Ветово|Две могили|Иваново|Русе|Сливо поле|Ценово";
	s_a[19]="Избери община|Алфатар|Главиница|Дулово|Кайнарджа|Силистра|Ситово|Тутракан";
	s_a[20]="Избери община|Котел|Нова Загора|Сливен|Твърдица";
	s_a[21]="Избери община|Баните|Борино|Девин|Доспат|Златоград|Мадан|Неделино|Рудозем|Смолян|Чепеларе";
	s_a[22]="Избери община|Антон|Божурище|Ботевград|Годеч|Горна Малина|Долна баня|Драгоман|Елин Пелин|Етрополе|Златица|Ихтиман|Копривщица|Костенец|Костинброд|Мирково|Пирдоп|Правец|Самоков|Своге|Сливница|Чавдар|Челопеч";
	s_a[23]="Избери община|Столична община";
	s_a[24]="Избери община|Братя Даскалови|Гурково|Гълъбово|Казанлък|Мъглиж|Николаево|Опан|Павел баня|Раднево|Стара Загора|Чирпан";
	s_a[25]="Избери община|Антоново|Омуртаг|Опака|Попово|Търговище";
	s_a[26]="Избери община|Димитровград|Ивайловград|Любимец|Маджарово|Минерални бани|Свиленград|Симеоновград|Стамболово|Тополовград|Харманли|Хасково";
	s_a[27]="Избери община|Велики Преслав|Венец|Върбица|Каолиново|Каспичан|Никола Козлево|Нови пазар|Смядово|Хитрино|Шумен";
	s_a[28]="Избери община|Болярово|Елхово|Стралджа|Тунджа|Ямбол";
	
	// Cities
	var c_a = new Array();
	
	//Благоевград
	c_a['Банско']="Избери населено място|Банско|Гостун|Добринище|Кремен|Места|Обидим|Осеново|Филипово";
	c_a['Белица']="Избери населено място|Бабяк|Белица|Горно Краище|Гълъбово|Дагоново|Златарица|Краище|Кузьово|Лютово|Орцево|Палатик|Черешово";
	c_a['Благоевград']="Избери населено място|Бело поле|Бистрица|Благоевград|Бучино|Българчево|Габрово|Горно Хърсово|Дебочица|Делвино|Дренково|Дъбрава|Еленово|Зелендол|Изгрев|Клисура|Лешко|Лисия|Логодаш|Марулево|Мощанец|Обел|Падеш|Покровник|Рилци|Селище|Церово";
	c_a['Гоце Делчев']="Избери населено място|Баничан|Борово|Брезница|Буково|Господинци|Гоце Делчев|Делчево|Добротино|Корница|Лъжница|Мусомища|Попови ливади";
	c_a['Гърмен']="Избери населено място|Балдево|Горно Дряново|Гърмен|Дебрен|Долно Дряново|Дъбница|Ковачевци|Крушево|Лещен|Марчево|Огняново|Ореше|Осиково|Рибново|Скребатно|Хвостяне"
	c_a['Кресна']="Избери населено място|Влахи|Горна Брезница|Долна Градешница|Кресна|Ощава|Сливница|Стара Кресна";
	c_a['Петрич']="Избери населено място|Баскалци|Беласица|Богородица|Боровичене|Вишлене|Волно|Габрене|Гега|Генерал Тодоров|Горчево|Долене|Долна Крушица|Долна Рибница|Долно Спанчево|Драгуш|Дрангово|Дреновица|Дреново|Зойчене|Иваново|Кавракирово|Камена|Капатово|Кладенци|Ключ|Коларово|Кромидово|Крънджилица|Кукурахцево|Кулата|Кърналово|Марикостиново|Марино поле|Мендово|Митино|Михнево|Ново Кономлади|Петрич|Право Бърдо|Първомай|Рибник|Рупите|Ръждак|Самуилова крепост|Самуилово|Скрът|Старчево|Струмешница|Тонско дебе|Тополница|Чурилово|Чуричени|Чучулигово|Яворница|Яково";
	c_a['Разлог']="Избери населено място|Баня|Барчево|Годлево|Горно Драгнище|Добърско|Долно Драгнище|Елешница|Разлог";
	c_a['Сандански']="Избери населено място|Бельово|Бождово|Виногради|Вихрен|Враня|Вълково|Голем Цалим|Голешово|Горна Сушица|Горно Спанчево|Дамяница|Дебрене|Джигурово|Долени|Златолист|Зорница|Калиманци|Катунци|Кашина|Ковачево|Кръстилци|Кърланово|Ладарево|Лебница|Левуново|Лехово|Лешница|Лиляново|Лозеница|Любовище|Любовка|Малки Цалим|Мелник|Ново Делчево|Ново Ходжово|Петрово|Пиперица|Пирин|Плоски|Поленица|Рожвен|Сандански|Склаве|Спатово|Стожа|Струма|Сугарево|Хотово|Храсна|Хръсово|Черешница|Яново";
	c_a['Сатовча']="Избери населено място|Боголин|Ваклиново|Вълкосел|Годешово|Долен|Жижево|Кочан|Крибул|Осина|Плетена|Сатовча|Слащен|Туховища|Фъргово";
	c_a['Симитли']="Избери населено място|Брежани|Брестово|Горно Осеново|Градево|Докатичево|Долно Осеново|Железница|Крупник|Мечкул|Полена|Полето|Ракитна|Сенокос|Симитли|Сухострл|Сушница|Тросково|Черниче";
	c_a['Струмяни']="Избери населено място|Велющец|Вракуповица|Гореме|Горна Крушница|Горна Рибница|Добри лаки|Драката|Игралище|Илинденци|Каменица|Клепало|Колибите|Кърпелево|Махалата|Микрево|Никудин|Палат|Раздол|Седелец|Струмяни|Цапарево"
	c_a['Хаджидимово']="Избери населено място|Абланица|Беслен|Блатска|Гайтаниново|Илинден|Копривлен|ЛъкиНова Ловча|Ново Лески|Парил|Петрелик|Садово|Теплен|Тешово|Хаджидимово";
	c_a['Якоруда']="Избери населено място|Аврамово|Бел камен|Бунцево|Конарско|Смолево|Черна Места|Юруково|Якоруда";
	
	//Бургас
	c_a['Айтос']="Избери населено място|Айтос|Дрянковец|Зетьово|Карагеоргиево|Караново|Лясково|Малка поляна|Мъглен|Пещерско|Пирне|Поляново|Раклиново|Съдиево|Тополица|Черна могила|Черноград|Чукарка";
	c_a['Бургас']="Избери населено място|Братово|Брястовец|Бургас|Българово|Димчево|Драгново|Извор|Изворище|Маринка|Миролюбово|Равнец|Твърдица";
	c_a['Камено']="Избери населено място|Винарско|Вратица|Желязово|Камено|Константиново|Кръстница|Ливада|Полски извор|Русокастро|Свобода|Трояново|Тръстиково|Черни връх";
	c_a['Карнобат']="Избери населено място|Аспарухово|Венец|Глумче|Деветак|Деветинци|Детелина|Добриново|Драганци|Драгово|Екзарх Антимово|Целезник|Житосвят|Зимен|Искра|Карнобат|Кликач|Козаре|Крумово градище|Крушово|Мъдрино|Невестино|Огнен|Раклица|Сан-Стефано|Сигмен|Смолник|Соколово|Сърнево|Хаджиите|Церковски|Черково";
	c_a['Малко Търново']="Избери населено място|Близнак|Връшлян|Бяла вода|Визица|Граматиково|Евренозово|Заберново|Звездец|Калово|Малко Търново|Младежко|Сливарово|Стоилово";
	c_a['Несебър']="Избери населено място|Баня|Гюльовца|Емона|Козница|Кошарица|Несебър|Обзор|Оризаре|Паницово|Приселци|Равда|Раковсково|Свети Влас|Тънково";
	c_a['Поморие']="Избери населено място|Александрово|Ахелой|Бата|Белодол|Габерово|Горица|Гълъбец|Дъбник|Каблешково|Каменар|Козичино|Косовец|Лъка|Медово|Поморие|Порой|Страцин";
	c_a['Приморско']="Избери населено място|Веселие|Китен|Ново Паничарево|Писменово|Приморско|Ясна поляна";
	c_a['Руен']="Избери населено място|Билка|Вишна|Вресово|Добра поляна|Добромир|Дропла|Дъскотна|Дюля|Заимчево|Зайчар|Каменяк|Каравельово|Листец|Люляково|Мрежичко|Планиница|Подгорец|Преображенци|Припек|Просеник|Рабойна|Речица|Рожден|Рудина|Руем|Рупча|Ръжица|Сини рид|Скалак|Снежа|Снягово|Соколец|Средна махала|Струя|Топчийско|Трънак|Череша|Шиварово|Ябълчево|Ясен";
	c_a['Созопол']="Избери населено място|Атия|Вършило|Гъбар|Зидарово|Индже войвода|Крушевец|Приспад|Равадиново|Равнна гора|Росен|Созопол|Черноморец";
	c_a['Средец']="Избери населено място|Белеврен|Белила|Бистрец|Богданово|Варовник|Вълчаново|Голямо Буково|Горно Ябълково|Гранитец|Граничар|Дебелт|Долно Ябълково|Драка|Драчево|Дюлево|Загорци|Зорница|Кирово|Кубадин|Малина|Момина църква|Орлинци|Проход|Пънчево|Радойново|Росеново|Светлина|Синьо камене|Сливово|Средец|Суходол|Тракийци|Факия";
	c_a['Сунгурларе']="Избери населено място|Бероново|Носилково|Ведрово|Везенково|Велислав|Вълчин|Горово|Грозден|Дъбовица|Есен|Завет|Камчия|Клишман|Костен|Лозарево|Лозница|Манолич|Подвис|Прилеп|Пчелин|Садово|Скала|Славянци|Сунгурларе|Съединение|Терзийско|Черница|Чубра";
	c_a['Царево']="Избери населено място|Ахтопол|Бродилово|Българи|Варвара|Велика|Изгрев|Кондолово|Кости|Лозенец|Резово|Синеморец|Фазаново|Царево";
	
	// Варна
	c_a['Аврен']="Избери населено място|Аврен|Бенковски|Близнаци|Болярци|Добри дол|Дъбравиново|Здравец|Казашка река|Китка|Круша|Приселци|Равна гора|Садово|Синдел|Тръстиково|Царевци|Юнак";
	c_a['Аксаково']="Избери населено място|Аксаково|Ботево|Водица|Въглен|Генерал Кантарджиево|Доброглед|Долнище|Засмяно|Зорница|Игнатиево|Изворско|Кичево|Климентово|Крумово|Куманово|Любен Каравелово|Новаково|Орешак|Осеново|Припек|Радево|Слънчево|Яребична";
	c_a['Белослав']="Избери населено място|Белослав|Езерово|Разделна|Страшимирово";
	c_a['Бяла']="Избери населено място|Бяла|Горица|Господиново|Дюлино|Попович|Самотино";
	c_a['Варна']="Избери населено място|Варна|Звездица|Казашко|Каменар|Константиново|Тополи";
	c_a['Ветрино']="Избери населено място|Белоградец|Ветрино|Габърница|Доброплодно|Млада гвардия|Момчилово|Невша|Неофит Рилски|Средно село|Ягхило";
	c_a['Вълчи дол']="Избери населено място|Бояна|Брестак|Войводино|Вълчи дол|Генерал Киселово|Генерал Колево|Добротич|Есеница|Звънец|Изворник|Искър|Калоян|Караманите|Кракра|Метличина|Михалич|Оборище|Радан войвода|Стефан Караджа|Страхил|Червенец|Щипско";
	c_a['Девня']="Избери населено място|Девня|Кипра|Падина";
	c_a['Долни чифлик']="Избери населено място|Булаир|Бърдарево|Веселин|Голица|Горен чифлик|Гроздьово|Детелина|Долни чифлик|Кривини|Нова Шипка|Ново Оряхово|Пчелник|Рудник|Солник|Старо Оряхово|Шкорпиловци|Юнец";
	c_a['Дългопол']="Избери населено място|Арковна|Аспарухово|Боряна|Величково|Дебелец|Дългопол|Камен дял|Комунари|Красимир|Лопушна|Медовец|Партизани|Поляците|Рояк|Сава|Сладка вода|Цонево";
	c_a['Провадия']="Избери населено място|Блъсково|Бозвелийско|Бързица|Венчан|Градинарово|Добрина|Житница|Златина|Китен|Комарево|Кривня|Манастир|Неново|Овчага|Петров дол|Равна|Провадия|Славейково|Снежина|Старосел|Тутраканци|Храброво|Чайка|Черковна|Черноок";
	c_a['Суворово']="Избери населено място|Баново|Дръндар|Изгрев|Калиманци|Левски|Николаевка|Просечен|Суворово|Чернево";
	
	// Велико Търново
	c_a['Велико Търново']="Избери населено място|Арбанаси|Балван|Белчевци|Беляковец|Бижовци|Бойчеви колиби|Бойчовци|Бочковци|Бояновци|Бранковци|Буковец|Велико Търново|Велчево|Ветринци|Виларе|Водолей|Войнежа|Вонеща вода|Въглевци|Върлинка|Габровци|Гащевци|Големаните|Горановци|Горен Еневец|Дебелец|Деветаците|Дечковци|Димитровци|Димовци|Дичин|Дойновци|Долен Еневец|Долни Дамяновци|Дунавци|Емен|Ивановци|Илевци|Йовчевци|Килифарево|Кисьовци|Кладни дял|Клъшка река|Куцаровци|Къпиново|Лагерите|Леденик|Малки чифлик|Малчовци|Марговци|Миндя|Мишеморков хан|Момин сбор|Нацовци|Никюп|Ново село|Осенарите|Пирамидата|Плаково|Пожерник|Поповци|Присово|Продановци|Пушево|Пчелище|Пъровци|Радковци|Райковци|Рашевци|Ресен|Русаля|Русковци|Самоводене|Самсиите|Сеймените|Семковци|Суха река|Сърненци|Терзиите|Тодоровци|Ушевци|Хотница|Цепенарите|Церова кория|Цонковци|Шемшево|Шереметя|Шодековци|Ялово";
	c_a['Горна Оряховица']="Избери населено място|Върбица|Горна Оряховица|Горски Горен Тръмбеш|Горски Долен Тръмбеш|Долна Оряховица|Драганово|Крушето|Паисий|Писарево|Поликраище|Правда|Първомайци|Стрелец|Янтра";
	c_a['Елена']="Избери населено място|Аплаци|Багалевци|Бадевци|Баевци|Баждари|Балуци|Беброво|Бейковци|Берковци|Блъсковци|Богданско|Бойковци|Босевци|Брезово|Бръчковци|Буйновци|Бялковци|Валето|Велковци|Велювци|Веселина|Високовци|Вълчовци до Майско|Вълчовци до Яковци|Вързилковци|Габрака|Ганев дол|Глоговец|Големани|Горни край|Горни Танчевци|Горска|Граматици|Гърдевци|Давери|Дайновци|Дебели рът|Добревци|Долни Марян|Долни Танчевци|Донковци|Драгановци|Драгановсковци|Драгийци|Драгневци|Дрента|Дуковци|Дърлевци|Елена|Зеленик|Иванивановци|Игнатовци|Илаков рът|Илиювци|Каменари|Кантари|Караиванци|Карандили|Киревци|Кожлювци|Козя река|Колари|Константин|Косевци|Костел|Котуци|Крилювци|Крумчевци|Лазарци|Лесиче|Майско|Марафелци|Мариновци|Марян|Махалници|Мийковци|Миневци|Мирчовци|Мъртвината|Недялковци|Нешевци|Николовци|Николчовци|Ничовци|Нюшковци|Палици|Папратлива|Пейковци|Петковци|Попрусевци|Попска|Радовци|Райновци|Ралиновци|Раювци|Ребревци|Руховци|Светославци|Средни колиби|Стойчевци|Стояновци|Султани|Събковци|Титевци|Тодювци|Томбето|Топузи|Трънковци|Тумбевци|Тънки рът|Търкашени|Угорялковци|Харваловци|Христовци|Хъневци|Цвеклювци|Чавдарци|Чакали|Червенковци|Черни дял|Шиливери|Шилковци|Шубеци|Яковци";
	c_a['Златарица']="Избери населено място|Горна Хаджийска|Горско Ново село|Горско Писарево|Дедина|Дединци|Делова махала|Долно Шивачево|Дуровци|Дълги припек|Златарица|Калайджии|Новогорци|Овощна|Равново|Разсоха|Резач|Рекичка|Родина|Росно|Сливовица|Средно село|Чешма|Чистово|Чуката";
	c_a['Лясковец']="Избери населено място|Джулюница|Добри дял|Драгижево|Козаревец|Лясковец|Мерданя";
	c_a['Павликени']="Избери населено място|Батак|Бутово|Бяла Черква|Вишовград|Върбовка|Горна Липница|Димча|Долна Липница|Дъскот|Караисен|Лесичери|Михалци|Мусина|Недан|Павликени|Паскалевец|Патреш|Росица|Сломер|Стамболово";
	c_a['Полски Тръмбеш']="Избери населено място|Вързулица|Иванча|Каранци|Климентово|Куцина|Масларево|Обединение|Орловец|Павел|Петко Каравелово|Полски Сеновец|Полски Тръмбеш|Раданово|Стефан Стамболово|Страхилово";
	c_a['Свищов']="Избери населено място|Алеково|Александрово|Българско Сливово|Вардим|Горна Студена|Деляновци|Драгомирово|Козловец|Морава|Овча могила|Ореш|Свищов|Совата|Хаджидимитрово|Царевец|Червена";
	c_a['Стражица']="Избери населено място|Асеново|Балканци|Благоево|Бряговица|Виноград|Владислав|Водно|Горски Сеновец|Железарци|Кавлак|Камен|Кесарево|Лозен|Любенци|Мирово|Николаево|Нова Върбовка|Ново градище|Стражица|Сушица|Теменуга|Царски извор";
	c_a['Сухиндол']="Избери населено място|Бяла река|Горско Калугерово|Горско Косово|Коевци|Красно градище|Сухиндол";
	
	// Видин
	c_a['Белоградчик']="Избери населено място|Белоградчик|Боровица|Вещица|Върба|Гранитово|Граничак|Дъбравка|Крачимир|Ошане|Праужда|Пролазница|Рабиша|Раяновци|Салаш|Сливовник|Стакевци|Струиндол|Чифлик";
	c_a['Бойница']="Избери населено място|Бойница|Бориловец|Градсковски колиби|Драгичеви колиби|Каниц|Периловец|Раброво|Шипикова махала|Шишенци";
	c_a['Брегово']="Избери населено място|Балей|Брегово|Връв|Гъмзово|Делейна|Калина|Косово|Куделин|Ракитница|Тияновци";
	c_a['Видин']="Избери населено място|Акациево|Антимово|Бела Рада|Ботево|Буковец|Видин|Войница|Въртоп|Гайтанци|Генерал Мариново|Гомотарци|Градец|Динковица|Долни Бошняк|Дружба|Дунавци|Жеглица|Ивановци|Иново|Каленик|Капитановци|Кошава|Кутово|Майор Узуново|Новоселци|Пешаково|Плакудер|Покрайна|Рупци|Синаговци|Слана бара|Сланотрън|Търняне|Цар Симеоново";
	c_a['Грамада']="Избери населено място|Бояново|Бранковци|Водна|Грамада|Медешевци|Милчина лъка|Срацимирово|Тошевци";
	c_a['Димово']="Избери населено място|Арчар|Бела|Владиченци|Воднянци|Върбовчец|Гара Орешец|Димово|Дълго поле|Държаница|Извор|Карбинци|Кладоруб|Костичовци|Лагошевци|Мали Дреновец|Медовница|Орешец|Острокапци|Септемврийци|Скомля|Шипот|Яньовец|Ярловица";
	c_a['Кула']="Избери населено място|Големаново|Извор махала|Коста Перчево|Кула|Полетковци|Старопатица|Тополовец|Цар-Петрово|Чичил";
	c_a['Макреш']="Избери населено място|Вълчек|Киреево|Макреш|Подгоре|Раковица|Толовица|Цар Шишманово";
	c_a['Ново село']="Избери населено място|Винарово|Неговановци|Ново село|Флорентин|Ясен";
	c_a['Ружинци']="Избери населено място|Бело поле|Гюргич|Динково|Дражинци|Дреновец|Плешивец|Роглец|Ружинци|Тополовец|Черно поле";
	c_a['Чупрене']="Избери населено място|Бостаните|Върбово|Горни Лом|Долни Лом|Протопопинци|Репляна|Средогрив|Търговище|Чупрене";
	
	//Враца
	c_a['Борован']="Избери населено място|Борован|Добролево|Малорад|Нивянин|Сираково";
	c_a['Бяла Слатина']="Избери населено място|Алтимир|Буковец|Бърдарски геран|Бъркачево|Бяла Слатина|Враняк|Габаре|Галиче|Драшан|Комарево|Попица|Соколаре|Тлачене|Търнава|Търнак";
	c_a['Враца']="Избери населено място|Баница|Бели извор|Веслец|Вировско|Власатица|Враца|Върбица|Голямо Пещене|Горно Пещене|Девене|Згориград|Костелево|Лиляче|Лютаджик|Мало Пещене|Мраморен|Нефела|Оходен|Паволче|Тишевица|Три кладенци|Челопек|Чирен";
	c_a['Козлодуй']="Избери населено място|Бутан|Гложене|Козлодуй|Крива бара|Хърлец";
	c_a['Криводол']="Избери населено място|Баурене|Ботуня|Галатин|Главаци|Големо Бабино|Градешница|Добруша|Краводер|Криводол|Лесура|Осен|Пудрия|Ракево|Уровене|Фурен";
	c_a['Мездра']="Избери населено място|Боденец|Брусен|Върбешница|Горна Бешовица|Горна Кремена|Долна Кремена|Дърманци|Елисейна|Зверино|Злидол|Игнатица|Кален|Крапец|Крета|Лик|Лютиброд|Лютидол|Мездра|Моравица|Оселна|Ослен Криводол|Очиндол|Ребърково|Руска Бела|Старо село|Типченица|Цаконица|Царевец";
	c_a['Мизия']="Избери населено място|Войводово|Крушовица|Липница|Мизия|Сараево|Софрониево";
	c_a['Оряхово']="Избери населено място|Галово|Горни Вадин|Долни Вадин|Лесковец|Оряхово|Остров|Селановци";
	c_a['Роман']="Избери населено място|Долна Бешовица|Камено поле|Караш|Кунино|Курново|Марково равнище|Радовене|Роман|Синьо бърдо|Средни рът|Стояновци|Струпец|Хубавене";
	c_a['Хайредин']="Избери населено място|Ботево|Бързина|Манастирище|Михайлово|Рогозен|Хайредин";
	
	// Габрово
	c_a['Габрово']="Избери населено място|Ангелов|Армените|Баевци|Баланите|Балиновци|Банковци|Бекриите|Беломъжите|Бобевци|Богданчовци|Боженците|Бойновци|Бойчета|Болтата|Борики|Борското|Брънеците|Бялково|Велковци|Ветрово|Влайчовци|Влаховци|Врабците|Враниловци|Вълков дол|Габрово|Гайкини|Гайтаните|Гарван|Геновци|Генчовци|Гергини|Гледаци|Горнова могила|Гръблевци|Гъбене|Дебел дял|Джумриите|Дивеци|Донино|Драгановци|Драганчетата|Драгиевци|Драгомани|Думници|Езерото|Живко|Жълтеш|Здравковец|Зелено дърво|Златевци|Иванили|Иванковци|Иглика|Източник|Камещица|Карали|Киевци|Калчовци|Кметовци|Кметчета|Кози рог|Колишовци|Копчелиите|Костадините|Костенковци|Лесичарка|Лоза|Малини|Малуша|Междени|Мечковица|Милковци|Михайловци|Мичковци|Моровеците|Мрахори|Музга|Николчовци|Новаковци|Овощарци|Орловци|Парчовци|Пейовци|Пенковци|Петровци|Пецовци|Попари|Поповци|Поток|Прахали|Продановци|Пъртевци|Райновци|Раховци|Рачевци|Редешковци|Руйчовци|Рязковци|Свинарски дол|Седянковци|Сейковци|Семерджиите|Смиловци|Солари|Спанци|Спасовци|Старилковци|Стефаново|Стоевци|Стойковци|Стойчовци|Стоманеците|Съботковци|Тодоровци|Тодорчета|Торбалъжите|Трапесковци|Трънито|Узуните|Фърговци|Харачерите|Цвятковци|Чавеи|Чарково|Червена локва|Черневци|Читаковци|Чукилите|Шарани|Шипчените|Яворец|Янковци|Ясените";
	c_a['Дряново']="Избери населено място|Балалея|Балванците|Банари|Билкини|Бучуковци|Ганчовец|Геня|Геша|Глушка|Гоздейка|Големи Българени|Горни Върпища|Горни Драгойча|Гостилица|Гърня|Денчевци|Джуровци|Длъгня|Добрените|Долни Върпища|Долни Драгойча|Доча|Дряново|Дурча|Еленците|Зая|Игнатовци|Искра|Каломен|Караиванца|Катранджии|Керека|Косарка|Косилка|Крънча|Кукля|Куманите|Къртипъня|Малки Българени|Маноя|Муця|Нейчовци|Пейна|Петковци|Плачка|Пърша|Радончето|Радовци|Ритя|Руня|Русиновци|Саласука|Скалско|Славейково|Соколово|Станча|Сухолоевци|Сяровци|Туркинча|Царева ливада|Чуково|Шушня|Янтра";
	c_a['Севлиево']="Избери населено място|Агатово|Батошево|Баева ливада|Бериево|Боазът|Богатово|Буря|Българи|Войнишка|Валевци|Горна Росица|Градище|Градница|Дамяново|Дебелцово|Дисманица|Добромирка|Дрянът|Душево|Душевски колиби|Дялък|Енев рът|Идилево|Карамичевци|Кастел|Корията|Кормянско|Крамолин|Крушево|Кръвеник|Купен|Ловнидол|Малиново|Малки Вършец|Мариновци|Младен|Млечево|Петко Славейков|Попска|Рогулят|Ряховците|Севлиево|Сенник|Стоките|Столът|Селище|Табашка|Тумбалово|Търхово|Угорелец|Хирево|Шопите|Шумата";
	c_a['Трявна']="Избери населено място|Азманите|Армянковци|Бангейци|Бахреци|Белица|Бижовци|Брежниците|Бърдарите|Бърдени|Веленци|Велково|Велчовци|Владовци|Власатили|Войниците|Вълковци|Гайдари|Генчовци|Глутниците|Големи Станчовци|Горни Дамяновци|Горни Маренци|Горни Радковци|Горни Цоневци|Горяни|Даевци|Димиевци|Добревци|Долни Маренци|Долни Радковци|Долни Томчевци|Донкино|Дончовци|Драгневци|Драндарите|Дървари|Дъскарите|Енчовци|Зеленика|Иван Димов|Иринеци|Йововци|Кашенци|Керените|Киселковци|Кисийците|Коевци|Койчовци|Колю Ганев|Конарското|Креслювци|Кръстеняците|Кръстец|Малки Станчовци|Малчовци|Маневци|Маруцековци|Матешовци|Милевци|Миковци|Могилите|Мръзеци|Недялковци|Неновци|Никачковци|Николаево|Ножерите|Носеите|Околиите|Павлевци|Планинци|Плачковци|Побък|Попгергевци|Попрайковци|Престой|Пържиграх|Радевци|Радино|Радоевци|Раевци|Райнушковци|Ралевци|Рачовци|Рашовите|Руевци|Свирци|Сечен камък|Скорците|Сливово|Стайновци|Станчов хан|Стражата|Стръмци|Тодореците|Томчевци|Трявна|Урвата|Фъревци|Фъртуни|Христовци|Чакалите|Черновръх|Ябълковци|Явор";
	
	// Добрич
	c_a['Балчик']="Избери населено място|Албена|Балчик|Безводица|Бобовец|Брястово|Гурково|Дропла|Дъбрава|Змеево|Карвуна|Кранево|Кремена|Ляхово|Оброчище|Преспа|Рогачево|Сенокос|Соколово|Стражица|Тригорци|Храброво|Царичино|Църква";
	c_a['Генерал Тошево']="Избери населено място|Александър Стамболийски|Балканци|Бежаново|Василево|Великово|Вичово|Генерал Тошево|Горица|Градини|Дъбовик|Житен|Зограф|Изворово|Йовково|Калина|Кардам|Конаре|Краище|Красен|Къпиново|Лозница|Люляково|Малина|Огражден|Петлешково|Писарово|Пленимир|Преселенци|Присад|Пчеларово|Равнец|Рогозина|Росен|Росица|Сираково|Сноп|Снягово|Спасово|Средина|Сърнино|Узово|Чернооково";
	c_a['Добрич']="Избери населено място|Добрич";
	c_a['Добрич-селска']="Избери населено място|Алцек|Самуилово|Батово|Бдинци|Бенковски|Богдан|Божурово|Бранище|Ведрина|Владимирово|Воднянци|Вратарите|Врачанци|Генерал Колево|Гешаново|Дебрене|Победа|Добрево|Долина|Дончево|Драганово|Дряновец|Енево|Житница|Златия|Камен|Карапелит|Козлодуйци|Котленци|Крагулево|Лясково|Ловчанци|Ломница|Малка Смолница|Медово|Методиево|Миладиновци|Ново Ботево|Овчарово|Одринци|Одърци|Опанец|Орлова могила|Паскалево|Плачидол|Подслон|Полковник Свещарово|Попгригорово|Прилеп|Приморци|Пчелино|Пчелник|Полковник Минково|Росеново|Свобода|Славеево|Смолница|Соколник|Полковник Иваново|Стефан Караджа|Стефаново|Стожер|Сливенци|Тянево|Фелдфебел Денково|Хитово|Царевец|Черна";
	c_a['Каварна']="Избери населено място|Белгун|Било|Божурец|Българево|Видно|Вранино|Иречек|Каварна|Камен бряг|Крупен|Могилище|Нейково|Поручик Чунчево|Раковски|Свети Никола|Селце|Септемврийци|Топола|Травник|Хаджи Димитър|Челопечене";
	c_a['Крушари']="Избери населено място|Абрит|Александрия|Бистрец|Габер|Добрин|Ефрейтор Бакалово|Загорци|Земенци|Зимница|Капитан Димитрово|Коритен|Крушари|Лозенец|Огняново Полковник Дяково|Поручик Кърджиево|Северняк|Северци|Телериг";
	c_a['Тервел']="Избери населено място|Ангеларий|Балик|Безмер|Божан|Бонево|Брестница|Войниково|Главанци|Градница|Гуслар|Жегларци|Зърнево|Каблешково|Кладенци|Коларци|Кочмар|Мали извор|Нова Камена|Оногур|Орляк|Полковник Савово|Попгруево|Професор Златарски|Сърнец|Тервел|Честименско";
	c_a['Шабла']="Избери населено място|Божаново|Ваклино|Горичане|Горун|Граничар|Дуранкулак|Езерец|Захари Стояново|Крапец|Пролез|Смин|Стаевци|Твърдица|Тюленово|Черноморци|Шабла";
	
	// Кърджали
	c_a['Ардино']="Избери населено място|Аврамово|Ардино|Ахрянско|Башево|Бистроглед|Богатино|Боровица|Брезен|Бял извор|Главник|Голобрад|Горно Прахово|Гърбище|Дедино|Дойранци|Долно Прахово|Дядовци|Еньовче|Жълтуша|Искра|Китница|Кроячево|Латинка|Левци|Ленище|Любино|Мак|Млечино|Мусево|Рибарци|Падина|Паспал|Песнопой|Правдолюб|Родопско|Русалско|Светулка|Седларци|Синчец|Сполука|Срънско|Стар Читак|Стояново|Сухово|Теменуга|Търна|Търносливка|Хромица|Червена скала|Чернигово|Чубрика|Ябълковец";
	c_a['Джебел']="Избери населено място|Албанци|Брежана|Великденче|Воденичарско|Вълкович|Генерал Гешево|Джебел|Добринци|Душинково|Желъдово|Жълти рид|Жълтика|Илийско|Казаците|Каменяне|Козица|Контил|Купците|Лебед|Мишевско|Мрежичко|Овчево|Папрат|Плазище|Подвръх|Полянец|Поточе|Припек|Ридино|Рогозари|Рогозче|Рът|Рожденско|Скалина|Слънчоглед|Софийци|Модрен|Сипец|Телчарка|Търновци|Тютюнче|Устрен|Цвятово|Църквица|Чакалци|Черешка|Щерна|Ямино";
	c_a['Кирково']="Избери населено място|Върбен|Априлци|Бенковски|Бързея|Брегово|Върли дол|Вълчанка|Горно Къпиново|Горски извор|Гривяк|Горно Кирково|Дедец|Делвино|Джерово|Добромирци|Долно Къпиново|Домище|Дрангово|Дружинци|Дрянова глава|Дюлица|Еровете|Завоя|Загорски|Здравчец|Светлен|Каялоба|Кирково|Китна|Козлево|Костурино|Кран|Крилатица|Кукуряк|Кърчовско|Кремен|Лозенградци|Малкоч|Медевци|Метличина|Метличка|Могиляне|Мъглене|Нане|Орлица|Островец|Пловка|Подкова|Пресека|Първенци|Първица|Растник|Самодива|Самокитка|Секирка|Средско|Старейшино|Старово|Стоманци|Стрижба|Тихомир|Фотиново|Хаджийско|Царино|Чавка|Чакаларово|Чичево|Чорбаджийско|Шипок|Шопци|Шумнатица|Яковица|Янино";
	c_a['Крумовград']="Избери населено място|Аврен|Багрилци|Бараци|Благун|Бойник|Бряговец|Бук|Вранско|Голяма Чинка|Голям Девесил|Голямо Каменяне|Горна кула|Горни Юруци|Гривка|Гулийка|Гулия|Девесилица|Девесилово|Джанка|Доборско|Долна кула|Долни Юруци|Дъждовник|Егрек|Едрино|Звънарка|Зиморница|Златолист|Калайджиево|Каменка|Кандилка|Качулка|Ковил|Кожухарци|Котлари|Красино|Крумовград|Къклица|Лещарка|Лимец|Луличка|Малка Чинка|Малко Каменяне|Малък Девесил|Метлика|Морянци|Овчари|Орешари|Падало|Пашинци|Пелин|Перуника|Подрумче|Полковник Желязово|Поточарка|Поточница|Раличево|Рибино|Рогач|Ручей|Самовила|Сбор|Синигер|Скалак|Сладкодум|Сливарка|Стари чал|Стражец Странджево|Студен кладенец|Сърнак|Тинтява|Токачка|Тополка|Хисар|Храстово|Чал|Черничево|Чернооки";
	c_a['Кърджали']="Избери населено място|Айрово|Багра|Бащино|Бели пласт|Бленика|Божак|Бойно|Болярци|Брош|Бяла поляна|Бялка|Велешани|Висока Висока поляна|Вишеград|Воловарци|Върбенци|Главатарци|Глухар|Гняздово|Голяма бара|Горна крепост|Гъсково|Добриново|Долище|Долна крепост|Дъждино|Дъждовница|Дънгово|Енчец|Жинзифово|Житарник|Зайчино|Звезделина|Звезден|Звиница|Звъника|Звънче|Зелениково|Зимзелен|Зорница|Иванци|Илиница|Калинка|Калоянци|Каменарци|Кобиляне|Кокиче|Кокошане|Конево|Костино|Крайно село|Крин|Крушевска|Крушка|Кърджали|Кьосево|Лисиците|Лъвово|Люляково|Майсторово|Македонци|Мартино|Миладиново|Мост|Мургово|Мъдрец|Невестино|Ненково|Опълченско|Орешница|Островица|Охлювец|Панчево|Пеньово|Пепелище|Перперек|Петлино|Повет|Прилепци|Пропаст|Пъдарци|Рани лист|Резбарци|Ридово|Рудина|Сватбаре|Севдалина|Седловина|Сестринско|Сипей|Скалище|Скална глава|Скърбино|Снежинка|Соколско|Соколяне|Солище|Срединка|Старо място|Стражевци|Страхил войвода|Стремово|Стремци|Татково|Тополчане|Три могили|Ходжовци|Царевец|Чеганци|Черешица|Черна скала|Черньовци|Чилик|Чифлик|Широко поле|Яребица|Ястреб";
	c_a['Момчилград']="Избери населено място|Ауста|Багрянка|Балабаново|Каменец|Биволяне|Врело|Горско Дюлево|Груево|Гургулица|Джелепско|Друмче|Девинци|Загорско|Звездел|Карамфил|Конче|Кос|Лале|Летовник|Манчево|Момина сълза|Момчилград|Нановица|Неофит Бозвелиево|Обичник|Пазарци|Пиявец|Плешинци|Постник|Птичар|Прогрес|Равен|Ралица|Садовица|Свобода|Седефче|Седлари|Синделци|Соколино|Сярци|Сенце|Татул|Чайка|Кременец|Чобанка|Чомаково|Чуково|Върхари|Юнаци";
	c_a['Черноочене']="Избери населено място|Бакалите|Бедрово|Безводно|Бели вир|Беснурка|Божурци|Боровско|Босилица|Бостанци|Бърза река|Верско|Водач|Вождово|Войново|Възел|Габрово|Даскалово|Драганово|Душка|Дядовско|Железник|Женда|Житница|Йончово|Каблешково|Каняк|Комунига|Копитник|Куцово|Лясково|Минзухар|Мурга|Небеска|Нови пазар|Новоселище|Ночево|Паничково|Патица|Петелово|Пряпорец|Пчеларово|Русалина|Свободиново|Соколите|Среднево|Средска|Стражница|Черна нива|Черноочене|Ябълчени|Яворово";
	
	// Кюстендил
	c_a['Бобов дол']="Избери населено място|Бабино|Бабинска река|Блато|Бобов дол|Голема Фуча|Голям Върбовник|Големо село|Горна Козница|Долистово|Коркина|Локвата|Мала Фуча|Мали Върбовник|Мало село|Мламолово|Новоселяне|Паничарево|Шатрово";
	c_a['Община Бобошево']="Избери населено място|Бадино|Блажиево|Бобошево|Висока могила|Вуково|Доброво|Каменик|Скрино|Слатино|Сопово|Усойка|Циклово";
	c_a['Кочериново']="Избери населено място|Бараково|Боровец|Бураново|Драгодан|Кочериново|Крумово|Мурсалево|Пороминово|Стоб|Фролош|Цървище";
	c_a['Кюстендил']="Избери населено място|Багренци|Берсин|Блатец|Бобешино|Богослов|Буново|Вратца|Гирчевци|Горановци|Горна Брестница|Горна Гращица|Горно Уйно|Грамаждано|Граница|Гурбановци|Гърбино|Гърляно|Гюешево|Дворище|Дождевица|Долна Гращица|Долно село|Долно Уйно|Драговищица|Жабокрът|Жеравино|Жиленци|Ивановци|Каменичка Скакавица|Катрище|Коняво|Копиловци|Коприва|Кутугерци|Кършалево|Кюстендил|Лелинци|Леска|Лисец|Лозно|Ломница|Мазарачево|Нови чифлик|Ново село|Николичевци|Пиперков чифлик|Полетинци|Полска Скакавица|Преколница|Радловци|Раненци|Режинци|Раждавица|Ръсово|Савойски|Сажденик|Скриняно|Слокощица|Соволяно|Стенско|Таваличево|Търновлаг|Търсино|Церовица|Црешново|Цървена ябълка|Цървендол|Цървеняно|Чудинци|Шипочано|Шишковци|Ябълково";
	c_a['Невестино']="Избери населено място|Ваксево|Ветрен|Длъхчево-Сабляр|Долна Козница|Друмохар|Еремия|Згурово|Илия|Кадровица|Лиляч|Мърводол|Невестино|Неделкова гращица|Пастух|Пелатиково|Раково|Рашка гращица|Смоличано|Страдалово|Тишаново|Църварица|Чеканец|Четирци";
	c_a['Рила']="Избери населено място|Падала|Пастра|Рила|Рилски манастир|Смочево";
	c_a['Сапарева баня']="Избери населено място|Овчарци|Паничище|Ресилово|Сапарева баня|Сапарево";
	c_a['Дупница']="Избери населено място|Баланово|Бистрица|Блатино|Грамаде|Делян|Джерман|Дяково|Крайни дол|Крайници|Кременик|Палатово|Пиперево|Самораново|Дупница|Тополница|Червен брег|Яхиново";
	c_a['Трекляно']="Избери населено място|Брест|Бъзовица|Габрешевци|Горни Коритен|Горно Кобиле|Добри дол|Долни Коритен|Долно Кобиле|Драгойчинци|Злогош|Киселица|Косово|Метохия|Побит камък|Средорек|Сушица|Трекляно|Уши|Чешлянци";
	
	// Ловеч
	c_a['Априлци']="Избери населено място|Велчево|Драшкова поляна|Априлци|Скандалото";
	c_a['Летница']="Избери населено място|Горско Сливово|Крушуна|Кърпачево|Летница";
	c_a['Ловеч']="Избери населено място|Абланица|Александрово|Баховица|Брестово|Българене|Владиня|Горан|Горно Павликене|Гостиня|Деветаки|Дойренци|Дренов|Дъбрава|Изворче|Йоглав|Казачево|Къкрина|Лешница|Лисец|Ловеч|Малиново|Прелом|Пресяка|Скобелево|Славяни|Слатина|Сливек|Смочан|Соколово|Стефаново|Радювене|Тепава|Умаревци|Хлевене|Чавдарци";
	c_a['Луковит']="Избери населено място|Бежаново|Беленци|Дерманци|Дъбен|Карлуково|Торос|Луковит|Петревене|Пещерна|Румянцево|Тодоричене|Ъглен";
	c_a['Тетевен']="Избери населено място|Български извор|Бабинци|Васильово|Галата|Глогово|Гложене|Голям извор|Градежница|Дивчовото|Малка Желязна|Рибарица|Тетевен|Черни Вит";
	c_a['Троян']="Избери населено място|Балабанско|Балканец|Бели Осъм|Белиш|Борима|Врабево|Голяма Желязна|Горно Трапе|Гумощник|Дебнево|Добродан|Дълбок дол|Калейца|Ломец|Орешак|Патрешко|Старо село|Терзийско|Троян|Черни Осъм|Чифлик|Шипково";
	c_a['Угърчин']="Избери населено място|Василковска махала|Голец|Драгана|Каленик|Катунец|Кирчево|Лесидрен|Микре|Орляне|Славщица|Сопот|Угърчин";
	c_a['Ябланица']="Избери населено място|Батулци|Брестница|Голяма Брестница|Добревци|Дъбравата|Златна Панега|Малък извор|Орешене|Ябланица";
	
	// Монтана
	c_a['Берковица']="Избери населено място|Балювица|Берковица|Бистрилица|Бокиловци|Боровци|Бързия|Гаганица|Замфирово|Комарево|Костенци|Котеновци|Лесковец|Мездрея|Песочница|Пърличево|Рашовица|Слатина|Цветкова бара|Черешовица|Ягодово";
	c_a['Бойчиновци']="Избери населено място|Бели брег|Бели брод|Бойчиновци|Владимирово|Громшин|Ерден|Кобиляк|Лехчево|Мадан|Мърчево|Охрид|Палилула|Портитовци";
	c_a['Брусарци']="Избери населено място|Брусарци|Буковец|Василовци|Дондуково|Дъбова Махала|Киселево|Княжева Махала|Крива бара|Одоровци|Смирненски";
	c_a['Вълчедръм']="Избери населено място|Ботево|Бъзовец|Вълчедръм|Септемврийци|Горни Цибър|Долни Цибър|Златия|Игнатово|Мокреш|Разград|Черни връх";
	c_a['Вършец']="Избери населено място|Вършец|Горна Бела речка|Горно Озирово|Долна Бела речка|Долно Озирово|Драганица|Спанчевци|Стояново|Черкаски";
	c_a['Георги Дамяново']="Избери населено място|Видлица|Гаврил Геново|Георги Дамяново|Главановци|Говежда|Дива Слатина|Дълги дел|Еловица|Каменна Рикса|Копиловци|Меляне|Помеждин|Чемиш";
	c_a['Лом']="Избери населено място|Добри дол|Долно Линево|Замфир|Ковачица|Лом|Орсоя|Сливата|Сталийска махала|Станево|Трайково";
	c_a['Медковец']="Избери населено място|Аспарухово|Медковец|Пишурка|Расово|Сливовик";
	c_a['Монтана']="Избери населено място|Безденица|Белотинци|Долно Белотинци|Благово|Винище|Вирове|Войници|Габровница|Горна Вереница|Горно Церовене|Доктор Йосифово|Долна Вереница|Долна Рикса|Клисурица|Крапчене|Липен|Монтана|Николово|Славотин|Смоляновци|Стубел|Студено буче|Сумер|Трифоново";
	c_a['Чипровци']="Избери населено място|Белимел|Горна Ковачица|Горна Лука|Железна|Мартиново|Митровци|Превала|Равна|Челюстница|Чипровци";
	c_a['Якимово']="Избери населено място|Долно Церовене|Дългоделци|Комощица|Якимово";
	
	// Пазарджик
	c_a['Батак']="Избери населено място|Батак|Нова махала|Фотиново";
	c_a['Белово']="Избери населено място|Аканджиево|Белово|Габровица|Голямо Белово|Дъбравите|Мененкьово|Момина клисура|Сестримо";
	c_a['Брацигово']="Избери населено място|Брацигово|Бяга|Жребичко|Исперихово|Козарско|Равногор|Розово";
	c_a['Велинград']="Избери населено място|Абланица|Алендарова|Биркова|Бозьова|Бутрева|Велинград|Всемирци|Враненци|Грашево|Горна Биркова|Горна Дъбева|Драгиново|Долна Дъбева|Кандови|Кръстава|Пашови|Рохлева|Света Петка|Цветино|Чолакова|Юндола";
	c_a['Лесичово']="Избери населено място|Боримечково|Динката|Калугерово|Лесичово|Памидово|Церово|Щърково";
	c_a['Пазарджик']="Избери населено място|Алеко Константиново|Априлци|Братаница|Величково|Гелеменово|Главиница|Говедаре|Дебръщица|Добровница|Драгор|Звъничево|Ивайло|Крали Марко|Ляхово|Мало Конаре|Мирянци|Мокрище|Овчеполци|Огняново|Пазарджик|Паталеница|Пищигово|Росен|Сарая|Сбор|Синитово|Тополи дол|Хаджиево|Цар Асен|Црънча|Черногорово|Юнаците";
	c_a['Панагюрище']="Избери населено място|Баня|Бъта|Елшица|Левски|Оборище|Панагюрище|Поибрене|Попинци|Панагюрски колонии|Сребриново";
	c_a['Пещера']="Избери населено място|Капитан Димитриево|Пещера|Радилово";
	c_a['Ракитово']="Избери населено място|Дорково|Костандово|Ракитово";
	c_a['Септември']="Избери населено място|Бошуля|Варвара|Ветрен|Ветрен дол|Виноградец|Горно Вършило|Долно Вършило|Злокучене|Карабунар|Ковачево|Лозен|Семчиново|Септември|Симеоновец|Славовица";
	c_a['Стрелча']="Избери населено място|Блатница|Дюлево|Свобода|Смилец|Стрелча";
	c_a['Сърница']="Избери населено място|Медени поляни|Побит камък|Сърница";
	
	// Перник
	c_a['Брезник']="Избери населено място|Арзан|Бабица|Банище|Бегуновци|Билинци|Брезник|Брезнишки извор|Брусник|Велковци|Видрица|Гигинци|Гоз|Горна Секирна|Горни Романци|Режанци|Гърло|Долна Секирна|Долни Романци|Душинци|Завала|Кошарево|Красава|Кривонос|Конска|Муртинци|Непразненци|Ноевци|Озърновци|Ребро|Ръжавец|Садовик|Слаковци|Сопица|Станьовци|Ярославци";
	c_a['Земен']="Избери населено място|Беренде|Блатешница|Враня стена|Габровдол|Горна Врабча|Горна Глоговица|Дивля|Долна Врабча|Еловдол|Жабляно|Земен|Калотинци|Мурено|Одраница|Падине|Пещера|Раянци|Смиров дол";
	c_a['Ковачевци']="Избери населено място|Егълница|Калище|Ковачевци|Косача|Лобош|Ракиловци|Светля|Сирищник|Слатино|Чепино";
	c_a['Перник']="Избери населено място|Богдановдол|Боснек|Вискяр|Витановци|Големо Бучино|Дивотино|Драгичево|Зидарци|Кладница|Кралев дол|Лесковец|Люлин|Мещица|Перник|Планиница|Радуй|Расник|Рударци|Селищен дол|Студена|Батановци|Чуйпетлово|Черна гора|Ярджиловци";
	c_a['Радомир']="Избери населено място|Байкалско|Беланица|Бобораци|Борнарево|Владимир|Горна Диканя|Гълъбник|Дебели лаг|Долна Диканя|Долни Раковец|Драгомирово|Дрен|Друган|Жедна|Житуша|Извор|Касилаг|Кондофрей|Копаница|Кленовик|Кошарите|Негованци|Николаево|Поцърненци|Прибой|Радибош|Радомир|Старо село|Стефаново|Углярци|Червена могила|Чуковец";
	c_a['Трън']="Избери населено място|Банкя|Берайнци|Богойна|Бохова|Бусинци|Бутроинци|Велиново|Видрар|Врабча|Вукан|Главановци|Глоговица|Горна Мелна|Горочевци|Джинчовци|Докьовци|Долна Мелна|Дълга лука|Ездимирци|Еловица|Ерул|Забел|Зелениград|Кожинци|Костуринци|Къшле|Лева река|Лешниковци|Ломница|Лялинци|Милкьовци|Милославци|Мракетинци|Мрамор|Насалевци|Неделково|Парамун|Пенкьовци|Проданча|Радово|Рани луг|Реяновци|Слишовци|Стайчовци|Стрезимировци|Студен извор|Трън|Туроковци|Филиповци|Цегриловци|Шипковица|Ярловци";
	
	// Плевен
	c_a['Белене']="Избери населено място|Белене|Бяла вода|Деков|Кулина вода|Петокладенци|Татари";
	c_a['Гулянци']="Избери населено място|Брест|Гиген|Гулянци|Долни Вит|Дъбован|Загражден|Искър|Крета|Ленково|Милковица|Сомовит|Шияково";
	c_a['Долна Митрополия']="Избери населено място|Байкал|Биволаре|Божурица|Брегаре|Горна Митрополия|Гостиля|Долна Митрополия|Комарево|Крушовене|Ореховица|Победа|Подем|Рибен|Славовица|Ставерци|Тръстеник";
	c_a['Долни Дъбник']="Избери населено място|Бъркач|Горни Дъбник|Градина|Долни Дъбник|Крушовица|Петърница|Садовец";
	c_a['Искър']="Избери населено място|Долни Луковит|Искър|Писарово|Староселци";
	c_a['Кнежа']="Избери населено място|Бреница|Еница|Кнежа|Лазарово";
	c_a['Левски']="Избери населено място|Асеновци|Аспарухово|Божурлук|Българене|Варана|Градище|Изгрев|Козар Белене|Левски|Малчика|Обнова|Стежерово|Трънчовица";
	c_a['Никопол']="Избери населено място|Асеново|Бацова махала|Въбел|Дебово|Драгаш войвода|Евлогиево|Жернов|Лозица|Любеново|Муселиево|Никопол|Новачене|Санадиново|Черковица";
	c_a['Плевен']="Избери населено място|Беглеж|Бохот|Брестовец|Бръшляница|Буковлък|Върбица|Горталово|Гривица|Дисевица|Коиловци|Къртожабене|Къшин|Ласкар|Мечка|Николаево|Опанец|Пелишат|Плевен|Радишево|Ралево|Славяново|Тодорово|Тученица|Търнене|Ясен";
	c_a['Пордим']="Избери населено място|Борислав|Вълчитрън|Згалево|Каменец|Катерица|Одърне|Пордим|Тотлебен";
	c_a['Червен бряг']="Избери населено място|Бресте|Глава|Горник|Девенци|Койнаре|Лепица|Радомирци|Ракита|Реселец|Рупци|Сухаче|Телиш|Червен бряг|Чомаковци";
	
	// Пловдив
	c_a['Асеновград']="Избери населено място|Асеновград|Бачково|Боянци|Бор|Врата|Горнослав|Добростан|Долнослав|Жълт камък|Златовръх|Избеглии|Нови извор|Изворово|Козаново|Конуш|Косово|Леново|Лясково|Мостово|Мулдава|Нареченски бани|Новаково|Орешец|Патриарх Евтимово|Стоево|Сини връх|Тополово|Три могили|Узуново|Червен";
	c_a['Брезово']="Избери населено място|Бабек|Борец|Брезово|Върбен|Дрангово|Зелениково|Златосел|Отец Кирилово|Пъдарско|Розовец|Свежен|Стрелци|Сърнегор|Тюркмен|Чехларе|Чоба";
	c_a['Калояново']="Избери населено място|Бегово|Главатар|Горна махала|Долна махала|Дуванлии|Дълго поле|Житница|Иван Вазово|Калояново|Отец Паисиево|Песнопой|Ръжево|Ръжево Конаре|Сухозем|Черноземен";
	c_a['Карлово']="Избери населено място|Баня|Бегунци|Богдан|Васил Левски|Ведраре|Войнягово|Горни Домлян|Домлян|Дъбене|Иганово|Калофер|Каравелово|Карлово|Климент|Клисура|Куртово|Кърнаре|Марино поле|Московец|Мраченик|Певците|Пролом|Розино|Слатина|Соколица|Столетово|Христо Даново";
	c_a['Кричим']="Избери населено място|Кричим";
	c_a['Куклен']="Избери населено място|Гълъбово|Добралък|Куклен|Руен|Цар Калоян|Яврово";
	c_a['Лъки']="Избери населено място|Балкан махала|Белица|Борово|Джурково|Дряново|Здравец|Лъкавица|Лъки|Манастир|Четрока|Югово";
	c_a['Марица']="Избери населено място|Бенковски|Войводиново|Войсил|Граф Игнатиево|Динк|Желязно|Калековец|Костиево|Крислово|Маноле|Манолско Конаре|Радиново|Рогош|Скутаре|Строево|Трилистник|Труд|Царацово|Ясно поле";
	c_a['Перущица']="Избери населено място|Перущица";
	c_a['Пловдив']="Избери населено място|Пловдив";
	c_a['Първомай']="Избери населено място|Брягово|Буково|Бяла река|Виница|Воден|Градина|Добри дол|Драгойново|Дълбок извор|Езерово|Искра|Караджалово|Крушево|Поройна|Православен|Първомай|Татарево";
	c_a['Раковски']="Избери населено място|Белозем|Болярино|Момино село|Раковски|Стряма|Чалъкови|Шишманци";
	c_a['Родопи']="Избери населено място|Белащица|Бойково|Браниполе|Брестник|Брестовица|Дедово|Златитрап|Извор|Кадиево|Крумово|Лилково|Марково|Оризари|Първенец|Ситово|Скобелево|Устина|Храбрино|Цалапица|Чурен|Ягодово";
	c_a['Садово']="Избери населено място|Ахматово|Богданица|Болярци|Караджово|Катуница|Кочево|Милево|Моминско|Поповица|Садово|Селци|Чешнегирово";
	c_a['Сопот']="Избери населено място|Анево|Сопот";
	c_a['Стамболийски']="Избери населено място|Йоаким Груево|Куртово Конаре|Ново село|Стамболийски|Триводици";
	c_a['Съединение']="Избери населено място|Голям чардак|Драгомир|Любен|Малък чардак|Найден Герово|Неделево|Правище|Съединение|Царимир|Церетелево";
	c_a['Хисаря']="Избери населено място|Беловица|Красново|Кръстевич|Мало Крушево|Михилци|Мътеница|Ново Железаре|Паничери|Старо Железаре|Старосел|Хисаря|Черничево";
	
	// Разград
	c_a['Завет']="Избери населено място|Брестовене|Веселец|Завет|Иван Шишманово|Острово|Прелез|Сушево";
	c_a['Исперих']="Избери населено място|Белинци|Бърдоква|Вазово|Голям Поровец|Делчево|Лудогорци|Духовец|Драгомъж|Исперих|Йонково|Китанчево|Конево|Къпиновци|Лъвино|Малко Йонково|Малък Поровец|Печеница|Подайва|Райнино|Свещари|Средоселци|Старо селище|Тодорово|Яким Груево";
	c_a['Кубрат']="Избери населено място|Беловец|Бисерци|Божурово|Горичево|Задруга|Звънарци|Каменово|Кубрат|Медовене|Мъдрево|Равно|Савин|Севар|Сеслав|Тертер|Точилари|Юпер";
	c_a['Лозница']="Избери населено място|Веселина|Гороцвет|Градина|Бели Лом|Каменар|Крояч|Лозница|Ловско|Манастирско|Манастирци|Островче|Сейдол|Синя вода|Студенец|Трапище|Тръбач|Чудомир";
	c_a['Разград']="Избери населено място|Балкански|Благоево|Гецово|Дряновец|Дянково|Киченица|Липник|Мортагоново|Недоклан|Осенец|Побит камък|Просторно|Пороище|Радинград|Разград|Раковски|Стражец|Топчии|Ушинци|Черковна|Ясеновец";
	c_a['Самуил']="Избери населено място|Богданци|Богомилци|Владимировци|Голяма вода|Голям Извор|Желязковец|Здравец|Кара Михал|Кривица|Ножарово|Пчелина|Самуил|Хума|Хърсово";
	c_a['Цар Калоян']="Избери населено място|Езерче|Костанденец|Цар Калоян";
	
	// Русе
	c_a['Борово']="Избери населено място|Батин|Борово|Брестовица|Волово|Горно Абланово|Екзарх Йосиф|Обретеник";
	c_a['Бяла']="Избери населено място|Бистренци|Лом Черковна|Босилковци|Ботров|Бяла|Дряновец|Копривец|Пейчиново|Пет кладенци|Полско Косово|Стърмен";
	c_a['Ветово']="Избери населено място|Ветово|Глоджево|Кривня|Писанец|Сеново|Смирненски";
	c_a['Две могили']="Избери населено място|Баниска|Батишница|Бъзовец|Две могили|Могилино|Каран Върбовка|Кацелово|Острица|Пепелина|Помен|Чилнов|Широково";
	c_a['Иваново']="Избери населено място|Божичен|Иваново|Кошов|Красен|Мечка|Нисово|Пиргово|Сваленик|Табачка|Тръстеник|Церовец|Червен|Щръклево";
	c_a['Русе']="Избери населено място|Басарбово|Долно Абланово|Мартен|Николово|Ново село|Просена|Русе|Сандрово|Семерджиево|Тетово|Хотанца|Червена вода|Ястребово|Бъзън";
	c_a['Сливо поле']="Избери населено място|Бабово|Борисово|Бръшлен|Голямо Враново|Кошарна|Малко Враново|Ряхово|Сливо поле|Стамболово|Черешово|Юделник";
	c_a['Ценово']="Избери населено място|Белцов|Беляново|Джулюница|Долна Студена|Караманово|Кривина|Новград|Пиперково|Ценово";
	
	// Силистра
	c_a['Алфатар']="Избери населено място|Алеково|Алфатар|Бистра|Васил Левски|Кутловица|Цар Асен|Чуковец";
	c_a['Главиница']="Избери населено място|Бащино|Богданци|Вълкан|Главиница|Дичево|Долно Ряхово|Зарица|Зафирово|Звенимир|Зебил|Калугерене|Коларово|Косара|Листец|Малък Преславец|Ножарево|Осен|Падина|Подлес|Сокол|Стефан Караджа|Суходол|Черногор";
	c_a['Дулово']="Избери населено място|Боил|Водно|Вокил|Върбино|Грънчарово|Долец|Дулово|Златоклас|Козяк|Колобър|Межден|Овен|Окорш|Орешене|Паисиево|Полковник Таслаково|Поройно|Правда|Прохлада|Раздел|Руйно|Секулово|Скала|Черковна|Чернолик|Черник|Яребица";
	c_a['Кайнарджа']="Избери населено място|Войново|Голеш|Господиново|Давидово|Добруджанка|Зарник|Кайнарджа|Каменци|Краново|Полковник Чолаково|Попрусаново|Посев|Светослав|Средище|Стрелково";
	c_a['Силистра']="Избери населено място|Айдемир|Бабук|Богорово|Брадвари|Българка|Ветрен|Главан|Йорданово|Казимир|Калипетрово|Полковник Ламбриново|Попкралево|Професор Иширково|Силистра|Смилец|Срацимир|Сребърна|Сърпово|Ценович";
	c_a['Ситово']="Избери населено място|Босна|Гарван|Добротица|Ирник|Искра|Любен|Нова Попина|Поляна|Попина|Ситово|Слатина|Ястребна";
	c_a['Тутракан']="Избери населено място|Антимово|Белица|Бреница|Варненци|Дунавец|Нова Черна|Пожарево|Преславци|Старо село|Сяново|Тутракан|Търновци|Царев дол|Цар Самуил|Шуменци";
	
	// Сливен
	c_a['Котел']="Избери населено място|Мокрен|Боринци|Братан|Градец|Дъбова|Жеравна|Катунище|Кипилово|Котел|Малко село|Медвен|Нейково|Орлово|Остра могила|Пъдарево|Седларево|Соколарци|Стрелци|Тича|Топузево|Филаретово|Ябланово";
	c_a['Нова Загора']="Избери населено място|Асеновец|Баня|Богданово|Брястово|Бял кладенец|Дядово|Езеро|Еленово|Загорци|Каменово|Караново|Коньово|Кортен|Крива круша|Любенец|Любенова махала|Млекарево|Научене|Нова Загора|Новоселец|Омарчево|Пет могили|Питово|Полско Пъдарево|Прохорово|Радево|Радецки|Сокол|Стоил войвода|Събрано|Съдиево|Съдийско поле|Ценино";
	c_a['Сливен']="Избери населено място|Биково|Бинкос|Блатец|Божевци|Бозаджии|Бяла|Въглен|Гавраилово|Гергевец|Глуфишево|Глушник|Голямо Чочовени|Горно Александрово|Градско|Драгоданово|Желю войвода|Зайчари|Злати войвода|Изгрев|Ичера|Калояново|Камен|Кермен|Ковачите|Крушаре|Малко Чочовени|Мечкарево|Младово|Николаево|Новачево|Панаретовци|Раково|Самуилово|Селиминово|Скобелево|Сливен|Сотиря|Средорек|Стара река|Старо село|Струпец|Тополчане|Трапоклово|Чинтулово|Чокоба";
	c_a['Твърдица']="Избери населено място|Близнец|Боров дол|Бяла паланка|Жълт бряг|Оризари|Сборище|Сърцево|Твърдица|Червенаково|Шивачево";
	
	// Смолян
	c_a['Баните']="Избери населено място|Баните|Босилково|Вишнево|Вълчан дол|Глогино|Гълъбово|Давидково|Две тополи|Дебеляново|Дрянка|Загражден|Кръстатица|Малка Арда|Малко Крушево|Оряховец|Планинско|Рибен дол|Сливка|Стърница|Траве";
	c_a['Борино']="Избери населено място|Борино|Буйново|Кожари|Чала|Ягодина";
	c_a['Девин']="Избери населено място|Беден|Брезе|Водни пад|Грохотно|Гьоврен|Девин|Жребево|Кестен|Лясково|Михалково|Осиково|Селча|Стоманево|Тешел|Триград|Чуруково";
	c_a['Доспат']="Избери населено място|Барутин|Бръщен|Доспат|Змеица|Късак|Любча|Црънча|Чавдар";
	c_a['Златоград']="Избери населено място|Аламовци|Долен|Ерма река|Златоград|Кушла|Пресока|Старцево|Страшимир|Фабрика|Цацаровци";
	c_a['Мадан']="Избери населено място|Арпаджик|Борика|Бориново|Боровина|Букова поляна|Буково|Вехтино|Високите|Вранинци|Върба|Върбина|Въргов дол|Габрина|Галище|Дирало|Долие|Касапско|Кориите|Крайна|Крушев дол|Купен|Леска|Лещак|Ливаде|Ловци|Мадан|Миле|Митовска|Мъглища|Петров дол|Печинска|Планинци|Равнил|Равнища|Равно нивище|Рустан|Средногорци|Стайчин дол|Студена|Тънкото|Уручовци|Цирка|Чурка|Шаренска";
	c_a['Неделино']="Избери населено място|Бурево|Върли дол|Върлино|Гърнати|Диманово|Дуня|Изгрев|Козарка|Кочани|Кундево|Еленка|Крайна|Неделино|Оградна|Средец|Тънка бара";
	c_a['Рудозем']="Избери населено място|Боево|Борие|Бърчево|Бяла река|Витина|Войкова лъка|Грамаде|Добрева череша|Дъбова|Елховец|Иваново|Кокорци|Коритата|Мочуре|Оглед|Пловдивци|Поляна|Равнината|Рибница|Рудозем|Сопотот|Чепинци";
	c_a['Смолян']="Избери населено място|Арда|Алиговска|Горна Арда|Баблон|Букаците|Белев дол|Билянска|Бориково|Бостина|Буката|Виево|Влахово|Вълчан|Върбово|Габрица|Гела|Гоздевица|Горово|Градът|Гудевица|Димово|Дунево|Еленска|Ельово|Заевите|Змиево|Чучур|Исьовци|Катранци|Киселчово|Кокорково|Кошница|Кремене|Кукувица|Кутела|Левочево|Липец|Лъка|Люлка|Ляска|Милково|Могилица|Мочуре|Момчиловци|Мугла|Надарци|Орешица|Остри пазлак|Петково|Пещера|Писаница|Подвис|Полковник Серафимово|Попрелка|Потока|Река|Речани|Ровина|Селище|Селища|Сивино|Славейно|Смилян|Смолян|Соколовци|Солища|Средок|Стикъл|Стойките|Стража|Студена|Сърнино|Тикале|Требище|Турян|Търън|Ухловица|Фатово|Хасовица|Чамла|Чеплетен|Черешките|Черешово|Черешовска река|Чокманово|Чучур|Широка лъка";
	c_a['Чепеларе']="Избери населено място|Богутево|Дряновец|Забърдо|Зорница|Лилеково|Малево|Орехово|Острица|Павелско|Проглед|Студенец|Хвойна|Чепеларе";
	
	// Софийска
	c_a['Антон']="Избери населено място|Антон";
	c_a['Божурище']="Избери населено място|Божурище|Гурмазово|Делян|Златуша|Мала Раковица|Пожарево|Пролеша|Росоман|Хераково|Храбърско";
	c_a['Ботевград']="Избери населено място|Боженица|Ботевград|Врачеш|Гурково|Еловдол|Краево|Липница|Литаково|Новачене|Радотина|Рашково|Скравена|Трудовец";
	c_a['Годеч']="Избери населено място|Бракьовци|Букоровци|Бърля|Връдловци|Върбница|Гинци|Годеч|Голеш|Губеш|Каленовци|Комщица|Лопушня|Мургаш|Равна|Разбоище|Ропот|Смолча|Станинци|Туден|Шума";
	c_a['Горна Малина']="Избери населено място|Априлово|Байлово|Белопопци|Гайтанево|Горна Малина|Горно Камарци|Долна Малина|Долно Камарци|Макоцево|Негушево|Осоица|Саранци|Стъргел|Чеканчево";
	c_a['Долна баня']="Избери населено място|Беренде|Беренде извор|Василовци|Вишан|Владиславци|Габер|Големо Малово|Горно село|Грълска падина|Долна Невля|Долно Ново село|Драгоил|Драгоман|Дреатин|Калотина|Камбелевци|Круша|Летница|Липинци|Мало Малово|Начево|Неделище|Несла|Ново Бърдо|Прекръсте|Раяновци|Табан|Цацаровци|Цръклевци|Чеканец|Чепърлянци|Чорул|Чуковезер|Ялботина";
	c_a['Драгоман']="Избери населено място|Богданлия|Габра|Голема Раковица|Григорево|Гара Елин Пелин|Доганово|Елин Пелин|Елешница|Караполци|Крушовица|Лесново|Мусачево|Нови хан|Огняново|Петково|Потоп|Равно поле|Столник|Чурек";
	c_a['Елин Пелин']="Избери населено място|Бойковец|Брусен|Горунака|Етрополе|Лопян|Лъга|Малки Искър|Оселна|Рибарица|Ямна";
	c_a['Етрополе']="Избери населено място|Бойковец|Брусен|Горунака|Етрополе|Лопян|Лъга|Малки Искър|Оселна|Рибарица|Ямна";
	c_a['Златица']="Избери населено място|Златица|Карлиево|Петрич|Църквище";
	c_a['Ихтиман']="Избери населено място|Бальовци|Белица|Боерица|Борика|Бузяковци|Бърдо|Вакарел|Венковец|Веринско|Джамузовци|Живково|Ихтиман|Костадинкино|Любница|Мечковци|Мирово|Мухово|Пановци|Пауново|Полянци|Поповци|Ръжана|Селянин|Стамболово|Черньово";
	c_a['Копривщица']="Избери населено място|Копривщица";
	c_a['Костенец']="Избери населено място|Голак|Горна Василица|Долна Василица|гр. Костенец|с. Костенец|Момин проход|Очуша|Подгорие|Пчелин";
	c_a['Костинброд']="Избери населено място|Безден|Богьовци|Бучин проход|Голяновци|Градец|Драговищица|Дреново|Дръмша|Костинброд|Опицвет|Петърч|Понор|Царичина|Чибаовци";
	c_a['Мирково']="Избери населено място|Бенковски|Брестака|Буново|Илинден|Каменица|Мирково|Плъзище|Преспа|Смолско|Хвърчил|Черковище";
	c_a['Пирдоп']="Избери населено място|Душанци|Пирдоп";
	c_a['Правец']="Избери населено място|Видраре|Джурово|Калугерово|Манаселска река|Осиковица|Осиковска Лакавица|Правец|Правешка Лакавица|Равнище|Разлив|Своде";
	c_a['Самоков']="Избери населено място|Алино|Бели Искър|Белчин|Белчински бани|Говедарци|Горни Окол|Гуцал|Долни Окол|Драгушиново|Злокучене|Клисура|Ковачевци|Лисец|Маджаре|Марица|Ново село|Поповяне|Продановци|Радуил|Райово|Рельово|Самоков|Шипочане|Широки дол|Яребковица|Ярлово";
	c_a['Своге']="Избери населено място|Бакьово|Батулия|Бов|Брезе|Брезовдол|Буковец|Владо Тричков|Габровница|Гара Бов|Гара Лакатник|Губислав|Добравица|Добърчин|Дружево|Еленов дол|Желен|Завидовци|Заноге|Заселе|Зимевица|Искрец|Лакатник|Левище|Лесковдол|Луково|Манастирище|Миланово|Огоя|Оплетня|Осеновлаг|Реброво|Редина|Свидня|Своге|Томпсън|Церецел|Церово|Ябланица";
	c_a['Сливница']="Избери населено място|Алдомировци|Бахалин|Братушково|Бърложница|Гургулят|Гълъбовци|Драготинци|Извор|Пищане|Повалиръж|Радуловци|Ракита|Сливница";
	c_a['Чавдар']="Избери населено място|Чавдар";
	c_a['Челопеч']="Избери населено място|Челопеч";
	
	// Столична община
	c_a['Столична община']="Избери населено място|София";
	
	// Стара Загора
	c_a['Братя Даскалови']="Избери населено място|Братя Даскалови|Верен|Голям дол|Горно Белево|Горно Ново село|Гранит|Долно Ново село|Колю Мариново|Малко Дряново|Малък дол|Марково|Медово|Мирово|Найденово|Опълченец|Оризово|Партизанин|Плодовитово|Православ|Славянин|Съединение|Сърневец|Черна гора";
	c_a['Гурково']="Избери населено място|Брестова|Гурково|Дворище|Димовци|Жълтопоп|Златирът|Конаре|Лява река|Паничерево|Пчелиново";
	c_a['Гълъбово']="Избери населено място|Априлово|Великово|Главан|Гълъбово|Искрица|Медникарово|Мусачево|Мъдрец|Обручище|Помощник|Разделна";
	c_a['Казанлък']="Избери населено място|Бузовград|Голямо Дряново|Горно Изворово|Горно Черковище|Долно Изворово|Дунавци|Енина|Казанлък|Копринка|Крън|Кънчево|Овощник|Розово|Ръжена|Средногорово|Хаджидимитрово|Черганово|Шейново|Шипка|Ясеново";
	c_a['Мъглиж']="Избери населено място|Борущица|Ветрен|Дъбово|Държавен|Зимница|Мъглиж|Радунци|Селце|Сливито|Тулово|Шаново|Юлиево|Яворовец|Ягода";
	c_a['Николаево']="Избери населено място|Едрево|Елхово|Николаево|Нова махала";
	c_a['Опан']="Избери населено място|Бащино|Бял извор|Бяло поле|Васил Левски|Венец|Княжевско|Кравино|Опан|Пъстрен|Средец|Столетово|Тракия|Ястребово";
	c_a['Павел баня']="Избери населено място|Александрово|Асен|Виден|Габарево|Горно Сахране|Долно Сахране|Манолово|Осетеново|Павел баня|Скобелево|Турия|Тъжа|Търничени";
	c_a['Раднево']="Избери населено място|Бели бряг|Боздуганово|Българене|Гледачево|Даскал-Атанасово|Диня|Землен|Знаменосец|Ковач|Ковачево|Коларово|Константиновец|Любеново|Маца|Полски Градец|Раднево|Рисиманово|Свободен|Сърнево|Тихомирово|Тополяне|Трояново|Трънково";
	c_a['Стара Загора']="Избери населено място|Арнаутито|Бенковски|Богомилово|Борилово|Борово|Братя Кунчеви|Бъдеще|Воденичарово|Горно Ботево|Дълбоки|Еленино|Елхово|Загоре|Змейово|Казанка|Калитиново|Калояновец|Кирилово|Козаревец|Колена|Ловец|Лозен|Люляк|Лясково|Маджерито|Малка Верея|Малко Кадиево|Михайлово|Могила|Ново село|Оряховица|Остра могила|Памукчии|Петрово|Плоска могила|Подслон|Преславен|Пряпорец|Пшеничево|Пъстрово|Ракитница|Руманя|Самуилово|Сладък кладенец|Стара Загора|Старозагорски бани|Стрелец|Сулица|Хан Аспарухово|Християново|Хрищени|Яворово";
	c_a['Чирпан']="Избери населено място|Винарово|Воловарово|Гита|Димитриево|Държава|Зетьово|Златна ливада|Изворово|Малко Тръново|Могилово|Осларка|Рупките|Свобода|Спасово|Средно градище|Стоян-Заимово|Целина|Ценово|Чирпан|Яздач";
	
	// Търговище
	c_a['Антоново']="Избери населено място|Антоново|Банковец|Богомолско|Букак|Великовци|Вельово|Глашатай|Голямо Доляне|Горна Златица|Девино|Длъжка поляна|Добротица|Долна Златица|Дъбравица|Изворово|Капище|Китино|Коноп|Крайполе|Крушолак|Къпинец|Кьосевци|Любичево|Малка Черковна|Малоградец|Манушевци|Мечово|Милино|Моравица|Моравка|Орач|Пиринец|Поройно|Присойна|Пчелно|Равно село|Разделци|Свирчово|Свободица|Семерци|Слънчовец|Стара речка|Старчище|Стеврек|Стойново|Стройновци|Таймище|Тиховец|Трескавец|Халваджийско|Чеканци|Черна вода|Черни бряг|Шишковица|Язовец|Яребично|Ястребино";
	c_a['Омуртаг']="Избери населено място|Беломорци|Българаново|Великденче|Величка|Веренци|Веселец|Висок|Врани кон|Голямо Църквище|Горна Хубавка|Горно Козарево|Горно Новково|Горско село|Долна Хубавка|Долно Козарево|Долно Новково|Зелена морава|Змейно|Звездица|Илийно|Камбурово|Кестеново|Козма Презвитер|Красноселци|Могилец|Обител|Омуртаг|Панайот Хитово|Паничино|Петрино|Плъстина|Птичево|Пъдарино|Първан|Росица|Рътлина|Станец|Тъпчилещово|Угледно|Царевци|Церовище|Чернокапци";
	c_a['Опака']="Избери населено място|Голямо Градище|Горско Абланово|Гърчиново|Крепча|Люблен|Опака";
	c_a['Попово']="Избери населено място|Априлово|Баба Тонка|Берковски|Бракница|Водица|Гагово|Глогинка|Горица|Долец|Долна Кабда|Дриново|Еленово|Заветно|Зараево|Захари Стояново|Звезда|Иванча|Кардам|Ковачевец|Козица|Конак|Ломци|Манастирица|Марчино|Медовина|Осиково|Паламарца|Помощица|Попово|Посабина|Садина|Светлен|Славяново|Тръстика|Цар Асен";
	c_a['Търговище']="Избери населено място|Алваново|Александрово|Баячево|Бистра|Божурка|Братово|Буйново|Буховци|Вардун|Васил Левски|Голямо Ново|Голямо Соколово|Горна Кабда|Давидово|Драгановец|Дралфа|Дългач|Здравец|Копрец|Кошничари|Кралево|Кръшно|Лиляк|Ловец|Макариополско|Маково|Миладиновци|Мировец|Момино|Надарево|Овчарово|Осен|Острец|Пайдушко|Певец|Подгорица|Преселец|Пресиян|Пресяк|Пробуда|Пролаз|Разбойна|Ралица|Росина|Руец|Стража|Съединение|Твърдинци|Търговище|Търновца|Цветница|Черковна";
	
	// Хасково
	c_a['Димитровград']="Избери населено място|Бодрово|Брод|Бряст|Великан|Воден|Върбица|Голямо Асеново|Горски извор|Димитровград|Длъгнево|Добрич|Долно Белево|Здравец|Златополе|Каснаково|Крепост|Крум|Малко Асеново|Меричлери|Радиево|Райново|Светлина|Скобелево|Сталево|Странско|Черногорово|Ябълково";
	c_a['Ивайловград']="Избери населено място|Бели дол|Белополци|Белополяне|Ботурче|Брусино|Бубино|Бялградец|Ветрушка|Вис|Глумово|Горно Луково|Горноселци|Горско|Гугутка|Долно Луково|Долноселци|Драбишна|Железари|Железино|Ивайловград|Казак|Камилски дол|Карловско|Кобилино|Кондово|Конници|Костилково|Ламбух|Ленско|Мандрица|Меден бук|Нова ливада|Одринци|Орешино|Пашкул|Плевун|Планинец|Покрован|Попско|Пъстроок|Розино|Сборино|Свирачи|Сив кладенец|Славеево|Соколенци|Хухла|Черни рид|Черничино|Чучулига";
	c_a['Любимец']="Избери населено място|Белица|Васково|Вълче поле|Георги Добрево|Дъбовец|Йерусалимово|Лозен|Любимец|Малко Градище|Оряхово";
	c_a['Маджарово']="Избери населено място|Бориславци|Габерово|Голяма долина|Горни Главанак|Горно поле|Долни Главанак|Долно Съдиево|Ефрем|Златоустово|Маджарово|Малки Воден|Малко Брягово|Малко Попово|Румелия|Ръженово|Селска поляна|Сеноклас|Тополово";
	c_a['Минерални бани']="Избери населено място|Ангел войвода|Боян Ботево|Брястово|Винево|Караманци|Колец|Минерални бани|Сираково|Спахиево|Сусам|Сърница|Татарево";
	c_a['Свиленград']="Избери населено място|Варник|Генералово|Дервишка могила|Димитровче|Капитан Андреево|Костур|Левка|Лисово|Маточина|Мезек|Михалич|Младиново|Момково|Мустрак|Пашово|Пъстрогор|Равна гора|Райкова могила|Свиленград|Сива река|Сладун|Студена|Чернодъб|Щит";
	c_a['Симеоновград']="Избери населено място|Дряново|Калугерово|Константиново|Симеоновград|Навъсен|Пясъчево|Свирково|Троян|Тянево";
	c_a['Стамболово']="Избери населено място|Балкан|Бял кладенец|Воденци|Войводенец|Гледка|Голобрадово|Голям извор|Долно Ботево|Долно поле|Долно Черковище|Жълти бряг|Зимовина|Кладенец|Кралево|Лясковец|Маджари|Малък извор|Поповец|Пчелари|Пътниково|Рабово|Светослав|Силен|Стамболово|Тънково|Царева поляна";
	c_a['Тополовград']="Избери населено място|Българска поляна|Владимирово|Доброселец|Капитан Петко Войвода|Каменна река|Княжево|Мрамор|Орешник|Орлов дол|Планиново|Присадец|Радовец|Сакарци|Светлина|Синапово|Срем|Тополовград|Устрем|Филипово|Хлябово|Чукарово";
	c_a['Харманли']="Избери населено място|Бисер|Богомил|Болярски извор|Браница|Българин|Върбово|Доситеево|Дрипчево|Иваново|Изворово|Коларово|Лешниково|Надежден|Овчарово|Орешец|Остър камък|Поляново|Преславец|Рогозиново|Славяново|Смирненци|Харманли|Черепово|Черна могила|Шишманово";
	c_a['Хасково']="Избери населено място|Александрово|Брягово|Войводово|Въгларово|Гарваново|Големанци|Горно Войводино|Гълъбец|Динево|Долно Войводино|Долно Големанци|Елена|Зорница|Клокотница|Книжовник|Козлец|Конуш|Корен|Криво поле|Любеново|Малево|Манастир|Мандра|Маслиново|Момино|Николово|Нова Надежда|Орлово|Подкрепа|Родопи|Стамболийски|Стойково|Текето|Тракиец|Узунджово|Хасково|Широка поляна";
	
	// Шумен
	c_a['Велики Преслав']="Избери населено място|Велики Преслав|Драгоево|Златар|Имренчево|Кочово|Миланово|Мокреш|Мостич|Осмар|Суха река|Троица|Хан Крум";
	c_a['Венец']="Избери населено място|Борци|Боян|Буйновица|Венец|Габрица|Денница|Дренци|Изгрев|Капитан Петко|Осеновец|Страхилица|Черноглавци|Ясенково";
	c_a['Върбица']="Избери населено място|Божурово|Бяла река|Върбица|Иваново|Конево|Крайгорци|Кьолмен|Ловец|Маломир|Менгишево|Методиево|Нова Бяла река|Станянци|Сушина|Тушовица|Чернооково";
	c_a['Каолиново']="Избери населено място|Браничево|Гусла|Дойранци|Долина|Загориче|Каолиново|Климент|Лиси връх|Лятно|Наум|Омарчево|Пристое|Сини вир|Средковец|Тодор Икономово|Тъкач";
	c_a['Каспичан']="Избери населено място|Върбяне|Златна нива|Каспичан|Каспичан|Косово|Кюлевча|Марково|Могила|Плиска";
	c_a['Никола Козлево']="Избери населено място|Векилски|Вълнари|Каравелово|Красен дол|Крива река|Никола Козлево|Пет могили|Ружица|Хърсово|Цани Гинчево|Църквица";
	c_a['Нови пазар']="Избери населено място|Беджене|Войвода|Енево|Жилино|Зайчино Ореше|Избул|Мировци|Нови пазар|Памукчии|Писарево|Правенци|Преселка|Сечище|Стан|Стоян Михайловски|Тръница";
	c_a['Смядово']="Избери населено място|Александрово|Бял бряг|Веселиново|Желъд|Кълново|Ново Янково|Риш|Смядово|Черни връх|Янково";
	c_a['Хитрино']="Избери населено място|Байково|Близнаци|Висока поляна|Върбак|Длъжко|Добри Войниково|Единаковци|Живково|Звегор|Иглика|Калино|Каменяк|Развигорово|Сливак|Становец|Студеница|Тервел|Тимарево|Трем|Хитрино|Черна";
	c_a['Шумен']="Избери населено място|Белокопитово|Благово|Васил Друмев|Велино|Ветрище|Вехтово|Градище|Дибич|Друмево|Ивански|Илия Блъсково|Кладенец|Костена река|Коньовец|Лозево|Мадара|Мараш|Новосел|Овчарово|Панайот Волово|Радко Димитриево|Салманово|Средня|Струино|Царев брод|Черенча|Шумен";
	
	// Ямбол
	c_a['Болярово']="Избери населено място|Болярово|Воден|Вълчи извор|Голямо Крушево|Горска поляна|Денница|Дъбово|Златиница|Иглика|Камен връх|Крайново|Малко Шарково|Мамарчево|Оман|Попово|Ружица|Ситово|Стефан Караджово|Странджа|Шарково";
	c_a['Елхово']="Избери населено място|Борисово|Бояново|Вълча поляна|Голям Дервент|Гранитово|Добрич|Елхово|Жребино|Изгрев|Кирилово|Лалково|Лесово|Малко Кирилово|Маломирово|Малък манастир|Мелница|Пчела|Раздел|Славейково|Стройно|Трънково|Чернозем";
	c_a['Стралджа']="Избери населено място|Атолово|Александрово|Богорово|Воденичане|Войника|Джинот|Зимница|Иречеково|Каменец|Леярово|Лозенец|Люлин|Маленово|Недялско|Палаузово|Поляна|Правдино|Първенец|Саранско|Стралджа|Тамарино|Чарда";
	c_a['Тунджа']="Избери населено място|Асеново|Безмер|Болярско|Ботево|Бояджик|Веселиново|Видинци|Генерал Тошево|Голям манастир|Гълъбинци|Дражево|Драма|Дряново|Завой|Златари|Генерал Инзово|Кабиле|Калчево|Каравелово|Козарево|Коневец|Крумово|Кукорево|Маломир|Меден кладенец|Межда|Миладиновци|Могила|Овчи кладенец|Окоп|Победа|Робово|Роза|Савино|Симеоново|Скалица|Сламино|Стара река|Тенево|Търнава|Хаджидимитрово|Ханово|Чарган|Челник";
	c_a['Ямбол']="Избери населено място|Ямбол";
	
	c_a['']="Избери населено място|";
	$('#oblast').change(function(){
		var c = $(this).val();
		var obshtini_arr = s_a[c].split("|");
		$('#obshtini').empty();
		$('#city').empty();
		if(c==0){
			$('#obshtini').append($('<option>', {
				value: '0',
				text: 'Избери община',
			}, '</option>'));
		}else {
			$.each(obshtini_arr, function (i, item_state) {
				$('#obshtini').append($('<option>', {
					value: item_state,
					text: item_state,
				}, '</option>'));
			});
		}
		$('#city').append($('<option>', {
			value: '0',
			text: 'Избери населено място',
		}, '</option>'));
	});

	$('#obshtini').change(function(){
		var s = $(this).val();
		if(s=='Избери община'){
			$('#city').empty();
			$('#city').append($('<option>', {
				value: '0',
				text: 'Избери населено място',
			}, '</option>'));
		}
		var city_arr = c_a[s].split("|");
		$('#city').empty();

		$.each(city_arr, function (j, item_city) {
			$('#city').append($('<option>', {
				value: item_city,
				text: item_city,
			}, '</option>'));
		});


	});
});